In [1]:
import pandas as pd
import numpy as np
from sklearn.neural_network import MLPClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics

In [179]:
data=pd.read_csv('train.csv',index_col=0)

In [180]:
age_mean=round(data['Age'].mean())
fare_mean=data['Fare'].mean()
data['Age'].fillna(age_mean,inplace=True)
data['Cabin'].fillna('M',inplace=True)

In [181]:
list_chamber=[]
list_cabin=list(data['Cabin'])
for i in list_cabin:
    list_chamber.append(i[0])
data.insert(11,'Chamber',list_chamber)
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Chamber
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,M,S,M
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,M,S,M
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,M,S,M
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,M,S,M
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,B
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,30.0,1,2,W./C. 6607,23.4500,M,S,M
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,M,Q,M

In [182]:
features=data[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked','Chamber']]
y=data['Survived']

In [183]:
features

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked Chamber
PassengerId
1                 3    male  22.0      1      0   7.2500        S       M
2                 1  female  38.0      1      0  71.2833        C       C
3                 3  female  26.0      0      0   7.9250        S       M
4                 1  female  35.0      1      0  53.1000        S       C
5                 3    male  35.0      0      0   8.0500        S       M
...             ...     ...   ...    ...    ...      ...      ...     ...
887               2    male  27.0      0      0  13.0000        S       M
888               1  female  19.0      0      0  30.0000        S       B
889               3  female  30.0      1      2  23.4500        S       M
890               1    male  26.0      0      0  30.0000        C       C
891               3    male  32.0      0      0   7.7500        Q       M

[891 rows x 8 columns]

using one hot encoder for categorical features

In [184]:
encoded_features=pd.get_dummies(features)
encoded_features.drop(columns='Chamber_T',inplace=True)
encoded_features

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Chamber_A,Chamber_B,Chamber_C,Chamber_D,Chamber_E,Chamber_F,Chamber_G,Chamber_M
PassengerId,,,,,,,,,,,,,,,,,,
1,3,22.0,1,0,7.2500,0,1,0,0,1,0,0,0,0,0,0,0,1
2,1,38.0,1,0,71.2833,1,0,1,0,0,0,0,1,0,0,0,0,0
3,3,26.0,0,0,7.9250,1,0,0,0,1,0,0,0,0,0,0,0,1
4,1,35.0,1,0,53.1000,1,0,0,0,1,0,0,1,0,0,0,0,0
5,3,35.0,0,0,8.0500,0,1,0,0,1,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,2,27.0,0,0,13.0000,0,1,0,0,1,0,0,0,0,0,0,0,1
888,1,19.0,0,0,30.0000,1,0,0,0,1,0,1,0,0,0,0,0,0
889,3,30.0,1,2,23.4500,1,0,0,0,1,0,0,0,0,0,0,0,1
890,1,26.0,0,0,30.0000,0,1,1,0,0,0,0,1,0,0,0,0,0
891,3,32.0,0,0,7.7500,0,1,0,1,0,0,0,0,0,0,0,0,1

In [207]:
x_train,x_test,y_train,y_test=train_test_split(encoded_features,y)

In [249]:
nn_model = MLPClassifier(hidden_layer_sizes=(100,100,100,100))
nn_model.fit(x_train,y_train)
predict_values=nn_model.predict(x_test)

In [250]:
confusion_m=metrics.confusion_matrix(y_test,predict_values)
confusion_m

array([[107,  28],
       [ 14,  74]], dtype=int64)

In [251]:
report=metrics.classification_report(y_test,predict_values)
print(report)

              precision    recall  f1-score   support

           0       0.88      0.79      0.84       135
           1       0.73      0.84      0.78        88

    accuracy                           0.81       223
   macro avg       0.80      0.82      0.81       223
weighted avg       0.82      0.81      0.81       223

In [252]:
train_pred=nn_model.predict(x_train)
train_rep=metrics.classification_report(y_train,train_pred)
print(train_rep)

              precision    recall  f1-score   support

           0       0.89      0.79      0.84       414
           1       0.71      0.84      0.77       254

    accuracy                           0.81       668
   macro avg       0.80      0.81      0.80       668
weighted avg       0.82      0.81      0.81       668

In [253]:
test_data=pd.read_csv('test.csv',index_col=0)
test_data['Age'].fillna(30,inplace=True)
test_data['Cabin'].fillna('M',inplace=True)
test_data['Fare'].fillna(fare_mean,inplace=True)
test_data

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,M,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,M,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,M,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,M,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,M,S
...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,30.0,0,0,A.5. 3236,8.0500,M,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,M,S
1308,3,"Ware, Mr. Frederick",male,30.0,0,0,359309,8.0500,M,S
1309,3,"Peter, Master. Michael J",male,30.0,1,1,2668,22.3583,M,C

In [254]:
t_list_chamber=[]
t_list_cabin=list(test_data['Cabin'])
for i in t_list_cabin:
    t_list_chamber.append(i[0])
test_data.insert(10,'Chamber',t_list_chamber)
test_data

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Chamber
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,M,Q,M
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,M,S,M
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,M,Q,M
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,M,S,M
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,M,S,M
...,...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,30.0,0,0,A.5. 3236,8.0500,M,S,M
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,M,S,M
1308,3,"Ware, Mr. Frederick",male,30.0,0,0,359309,8.0500,M,S,M
1309,3,"Peter, Master. Michael J",male,30.0,1,1,2668,22.3583,M,C,M

In [255]:
t_features=test_data[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked','Chamber']]
t_encoded_features=pd.get_dummies(t_features)
t_encoded_features

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Chamber_A,Chamber_B,Chamber_C,Chamber_D,Chamber_E,Chamber_F,Chamber_G,Chamber_M
PassengerId,,,,,,,,,,,,,,,,,,
892,3,34.5,0,0,7.8292,0,1,0,1,0,0,0,0,0,0,0,0,1
893,3,47.0,1,0,7.0000,1,0,0,0,1,0,0,0,0,0,0,0,1
894,2,62.0,0,0,9.6875,0,1,0,1,0,0,0,0,0,0,0,0,1
895,3,27.0,0,0,8.6625,0,1,0,0,1,0,0,0,0,0,0,0,1
896,3,22.0,1,1,12.2875,1,0,0,0,1,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3,30.0,0,0,8.0500,0,1,0,0,1,0,0,0,0,0,0,0,1
1306,1,39.0,0,0,108.9000,1,0,1,0,0,0,0,1,0,0,0,0,0
1307,3,38.5,0,0,7.2500,0,1,0,0,1,0,0,0,0,0,0,0,1
1308,3,30.0,0,0,8.0500,0,1,0,0,1,0,0,0,0,0,0,0,1
1309,3,30.0,1,1,22.3583,0,1,1,0,0,0,0,0,0,0,0,0,1

In [256]:
y_pred=nn_model.predict(t_encoded_features)
y_pred

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1,
       1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1,
       1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [257]:
results=pd.DataFrame(index=test_data.index)
results.insert(0,'Survived',y_pred)
results

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 0
...               ...
1305                0
1306                1
1307                0
1308                0
1309                0

[418 rows x 1 columns]

In [258]:
results.to_csv('Results.csv')